<?php
/**
 * ###############################################
 *
 * SWIFT Framework
 * _______________________________________________
 *
 * @author         Varun Shoor
 *
 * @package        SWIFT
 * @copyright      Copyright (c) 2001-2014, Kayako
 * @license        http://www.kayako.com/license
 * @link           http://www.kayako.com
 *
 * ###############################################
 */


$__LANG = array(
    'tickets'                   => 'Заявки',
    'tabgeneral'                => 'Общие',
    'tabpermissions'            => 'Доступ',
    'managetypes'               => 'Типы',
    'winedittickettype'         => 'Редактировать тип заявки: %s',
    'typetitle'                 => 'Название типа заявки',
    'desc_typetitle'            => 'Например <em>Ошибка</em> или <em>Посетить сайт</em>.',
    'typevisibility'            => 'Видимость',
    'titlemastertypedelete'     => 'Невозможно удалить "%d" типов заявок',
    'msgmastertypedelete'       => 'Kayako не может удалить следующие основные типы заявок:',
    'inserttype'                => 'Добавить тип',
    'edittype'                  => 'Редактировать тип',
    'displayorder'              => 'Порядок отображения',
    'desc_displayorder'         => 'Это порядок отображения элементов по умолчанию. Список элментов отображается в порядке возрастания.',
    'typevisibility2'           => 'Видимость',
    'desc_typevisibility2'      => 'Выберите видимость вида заявки. Публичные типы видны только в центре поддержки клиентов, тогда как приватные типы видны только сотрудникам.',
    'typedepartment'            => 'Связь',
    'desc_typedepartment'       => 'Эта настройка позволяет связывать этот тип заявок с одним из существующих департаментов. Если тип заявки связан с одним из департаментов, он будет виден только в том департаменте, к которому он привязан.',
    'typealldep'                => '-- Не связан --',
    'displayicontype'           => 'Значок',
    'desc_displayicontype'      => 'Загрузите изображение или введите полный URL изображения, которое будет отображаться как индикатор этого типа заявок.  Вы можете использовать {$themepath} как переменную замены для полного URL в каталоге, например <em>{$themepath}icon_typetask.gif</em>.  Рекомендуемый размер изображения - 16x16 пикселей.',
    'titledeltickettype'        => 'Удалено "%d" типов заявок',
    'msgdeltickettype'          => 'Следующие типы заявок были успешно удалены из базы данных:',
    'titletickettypeinsert'     => 'Добавлен тип заявки "%s"',
    'msgtickettypeinsert'       => 'Тип заявки "%s" был успешно добавлен в базу данных.',
    'titletickettypeupdate'     => 'Обновлен тип заявки "%s"',
    'msgtickettypeupdate'       => 'Тип заявки "%s" был успешно обновлен.',
    'uservisibilitycustom'      => 'Ограничить права доступа групп пользователей',
    'desc_uservisibilitycustom' => 'Когда эта опция включена, только указанные группы пользователей смогут видеть этот тип заявки. Эта опция доступна только при условии, что выбрана ПУБЛИЧНАЯ видимость.',
    'usergroups'                => 'Группы пользователей',
    'tabpermissions'            => 'Доступ',
    'tablanguages'              => 'Языки: Перевод',
);


return $__LANG;
