<?php
/**
 * ###############################################
 *
 * SWIFT Framework
 * _______________________________________________
 *
 * @author         Varun Shoor
 *
 * @package        SWIFT
 * @copyright      Copyright (c) 2001-2014, QuickSupport
 * @license        http://www.kayako.com/license
 * @link           http://www.kayako.com
 *
 * ###############################################
 */

$__LANG = array(
    // ======= BEGIN v4 LOCALES =======
    'tickets'                  => 'Заявки',
    'sizenolimit'              => '-- Без ограничений --',
    'tabgeneral'               => 'Общие',
    'extension'                => 'Расширение',
    'desc_extension'           => 'Укажите расширение для этого типа файлов. Примеры:<BR /><BR />doc<BR />txt<BR />pdf',
    'maxsize'                  => 'Максимальный размер (KB)',
    'desc_maxsize'             => 'Пожалуйста, укажите максимальный размер для этого типа расширения. Любые вложения, превышающие указанный размер, не будут прикреплены. Введите "0", чтобы не задавать ограничения на размер файлов.',
    'insertfiletype'           => 'Добавить тип файла',
    'desc_insertfiletype'      => '',
    'filetypeoptions'          => 'Дополнительные настройки',
    'acceptsupportcenter'      => 'Принимать от центра поддержки',
    'desc_acceptsupportcenter' => 'Когда эта опция включена, система будет принимать указанный тип файла, при условии, что пользователь отправил его через центр поддержки клиентов.',
    'acceptmailparser'         => 'Принимать от парсера почты',
    'desc_acceptmailparser'    => 'Когда эта опция включена, система будет принимать указанный тип файла, при условии, что пользователь отправил его по электронной почте.',
    'invalidattachmenttype'    => 'Недопустимый тип вложения. Пожалуйста, убедитесь, что данная запись существует в базе данных.',
    'editfiletype'             => 'Редактировать тип файла',
    'desc_editfiletype'        => '',
    'managefiletypes'          => 'Типы файлов',
    'wineditfiletype'          => 'Редактировать тип файлов: %s',
    'titlefiletypeinsert'      => 'Добавлен тип файлов: "%s"',
    'msgfiletypeinsert'        => 'Тип файлов "%s" был успешно добавлен в базу данных.',
    'titlefiletypeupdate'      => 'Обновлен тип файлов: "%s" ',
    'msgfiletypeupdate'        => 'Тип файлов "%s" был успешно обновлен.',
    'titlefiletypeextmismatch' => 'Недопустимое расширение файлов: %s"',
    'msgfiletypeextmismatch'   => 'Невозможно добавить/обновить этот тип файлов, так как запись с расширением "%s" уже существует.',
    'titledelfiletype'         => 'Удалено "%d" типов файлов',
    'msgdelfiletype'           => 'Следующие типы файлов были успешно удалены из базы данных:',
    // ======= END v4 LOCALES =======
);

return $__LANG;
