<?php
/**
 * ###############################################
 *
 * SWIFT Framework
 * _______________________________________________
 *
 * @author         Varun Shoor
 *
 * @package        SWIFT
 * @copyright      Copyright (c) 2001-2014, Kayako
 * @license        http://www.kayako.com/license
 * @link           http://www.kayako.com
 *
 * ###############################################
 */

$__LANG = array(
    // ======= BEGIN v4 LOCALES =======
    'tabkbindex'           => 'Восстановить индекс поиска',
    'knowledgebase'        => 'База знаний',
    'maintenance'          => 'Управление',
    'rebuild'              => 'Восстановить',
    'articlesperpass'      => 'Размер пакета',
    'desc_articlesperpass' => 'Введите количество разделов для обработки в одном пакете <i>(по умолчанию = 100).</i><br/><br/>В связи с ограничениями использования памяти и процессора не рекомендуется указывать значение больше чем сто (100).<br/><br/><font color="cc3300">Внимание: Во время обработки пакета, счетчик затраченного времени <i>не</i> будет обновляться, но процесс будет все равно происходить!</font>',
    'reindexheader'        => '<b>Процесс переиндексации</b>',
    'totalreplies'         => 'Общее # разделов в базе данных:',
    'articlesprocesed'     => '# обработанных разделов:',
    'timeelapsed'          => 'Затраченное время:',
    'timeremaining'        => 'Оставшееся время (приблизительно):',
);

return $__LANG;
